[{"_id":{"$oid":"658467a5c15573864fabd0f5"},"name":"Yellowface","author":"R.F. Kuang","categories":"Historical Fiction","price":62,"publishYear":2006,"rating":4.0,"description":"R.F. Kuang continues her astonishing ascent from genre specialist to literary sensation with Yellowface, a lacerating parable about the publishing industry itself. A combination of satire, metafiction, and slow-burn thriller, the book ultimately delivers a sly cultural critique concerning race and tokenism in the book business.","imageCover":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1671336608l/62047984.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"yellow-face","__v":0,"inStock":42},
{"_id":{"$oid":"658467a5c15573864fabd0f6"},"name":"Someone Else's Shoes","author":"Jojo Moyes","categories":"Romance","price":23,"publishYear":2018,"rating":4.4,"description":"A story of mix-ups, mess-ups and making the most of second chances, this is the new novel from #1 New York Times bestselling author Jojo Moyes, author of Me Before You and The Giver of Stars. Who are you when you are forced to walk in someone else’s shoes?","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1666822989i/62971668.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"Someone-Else-Shoes","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd0f7"},"name":"Big Swiss","author":"Jen Beagin","categories":"Fiction","price":61,"publishYear":2005,"rating":3.7,"description":"A brilliantly original and funny novel about a sex therapist’s transcriptionist who falls in love with a client while listening to her sessions. When they accidentally meet in real life, an explosive affair ensues.\n","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1653958990i/60701439.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"__v":0},
{"_id":{"$oid":"658467a5c15573864fabd0f8"},"name":"Evil Eye","author":"Etaf Rum","categories":"Fiction","price":65,"publishYear":2006,"rating":3.95,"description":"The acclaimed New York Times bestselling author of A Woman Is No Man returns with a striking exploration of the expectations of Palestinian-American women, the meaning of a fulfilling life, and the ways our unresolved pasts affect our presents.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1660158235i/59381516.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"php-oracle-web-development-3","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd0f4"},"name":"Predictably Irrational: The Hidden Forces That Shape Our Decisions","author":"Dan Ariely","categories":"Psychology","price":44,"publishYear":2007,"rating":3.72,"description":"Why do our headaches persist after taking a one-cent aspirin but disappear when we take a 50-cent aspirin?\n\nWhy does recalling the Ten Commandments reduce our tendency to lie, even when we couldn't possibly be caught?","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1255573980i/1713426.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"agile-web-development-with-rails","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd0fa"},"name":"Thinking, Fast and Slow","author":"Daniel Kahneman","categories":"Self Help","price":53,"publishYear":2016,"rating":3.8501385386125495,"description":"In the highly anticipated Thinking, Fast and Slow, Kahneman takes us on a groundbreaking tour of the mind and explains the two systems that drive the way we think. System 1 is fast, intuitive, and emotional; System 2 is slower, more deliberative, and more logical. Kahneman exposes the extraordinary capabilities—and also the faults and biases—of fast thinking, and reveals the pervasive influence of intuitive impressions on our thoughts and behavior. The impact of loss aversion and overconfidence on corporate strategies, the difficulties of predicting what will make us happy in the future, the challenges of properly framing risks at work and at home, the profound effect of cognitive biases on everything from playing the stock market to planning the next vacation—each of these can be understood only by knowing how the two systems work together to shape our judgments and decisions. \nEngaging the reader in a lively conversation about how we think, Kahneman reveals where we can and cannot trust our intuitions and how we can tap into the benefits of slow thinking. He offers practical and enlightening insights into how choices are made in both our business and our personal lives—and how we can use different techniques to guard against the mental glitches that often get us into trouble. Thinking, Fast and Slow will transform the way you think about thinking.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1317793965i/11468377.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"modx-web-development","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd0fc"},"name":"The Power of Habit: Why We Do What We Do in Life and Business","author":"Charles Duhigg","categories":"Self Help","price":22,"publishYear":2005,"rating":3.40978838525805,"description":"A young woman walks into a laboratory. Over the past two years, she has transformed almost every aspect of her life. She has quit smoking, run a marathon, and been promoted at work. The patterns inside her brain, neurologists discover, have fundamentally changed.\n\nMarketers at Procter & Gamble study videos of people making their beds. They are desperately trying to figure out how to sell a new product called Febreze, on track to be one of the biggest flops in company history. Suddenly, one of them detects a nearly imperceptible pattern—and with a slight shift in advertising, Febreze goes on to earn a billion dollars a year.\n\nAn untested CEO takes over one of the largest companies in America. His first order of business is attacking a single pattern among his employees—how they approach worker safety—and soon the firm, Alcoa, becomes the top performer in the Dow Jones.\n\nWhat do all these people have in common? They achieved success by focusing on the patterns that shape every aspect of our lives.\n\nThey succeeded by transforming habits.\n\nIn The Power of Habit, award-winning New York Times business reporter Charles Duhigg takes us to the thrilling edge of scientific discoveries that explain why habits exist and how they can be changed. With penetrating intelligence and an ability to distill vast amounts of information into engrossing narratives, Duhigg brings to life a whole new understanding of human nature and its potential for transformation.\n\nAlong the way we learn why some people and companies struggle to change, despite years of trying, while others seem to remake themselves overnight. We visit laboratories where neuroscientists explore how habits work and where, exactly, they reside in our brains. We discover how the right habits were crucial to the success of Olympic swimmer Michael Phelps, Starbucks CEO Howard Schultz, and civil-rights hero Martin Luther King, Jr. We go inside Procter & Gamble, Target superstores, Rick Warren’s Saddleback Church, NFL locker rooms, and the nation’s largest hospitals and see how implementing so-called keystone habits can earn billions and mean the difference between failure and success, life and death.\n\nAt its core, The Power of Habit contains an exhilarating argument: The key to exercising regularly, losing weight, raising exceptional children, becoming more productive, building revolutionary companies and social movements, and achieving success is understanding how habits work.\n\nHabits aren’t destiny. As Charles Duhigg shows, by harnessing this new science, we can transform our businesses, our communities, and our lives.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1545854312i/12609433.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"professional-javascript-for-web-developers","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd0fd"},"name":"Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones","author":"James Clear","categories":"Self Help","price":24,"publishYear":2014,"rating":1.6434172227048798,"description":"No matter your goals, Atomic Habits offers a proven framework for improving—every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results.\n\nIf you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you'll get a proven system that can take you to new heights.\n\nClear is known for his ability to distill complex topics into simple behaviors that can be easily applied to daily life and work. Here, he draws on the most proven ideas from biology, psychology, and neuroscience to create an easy-to-understand guide for making good habits inevitable and bad habits impossible. Along the way, readers will be inspired and entertained with true stories from Olympic gold medalists, award-winning artists, business leaders, life-saving physicians, and star comedians who have used the science of small habits to master their craft and vault to the top of their field.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1655988385i/40121378.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"art-of-java-web-development:-struts-tapestry-commons-velocity-junit-axis-cocoon-internetbeans-webwork","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd0fe"},"name":"Can't Hurt Me: Master Your Mind and Defy the Odds","author":"David Goggins","categories":"Self Help","price":35,"publishYear":2015,"rating":2.333454868630045,"description":"New York Times Best SellerOver 5 million copies soldFor David Goggins, childhood was a nightmare -- poverty, prejudice, and physical abuse colored his days and haunted his nights. But through self-discipline, mental toughness, and hard work, Goggins transformed himself from a depressed, overweight young man with no future into a U.S. Armed Forces icon and one of the world's top endurance athletes. The only man in history to complete elite training as a Navy SEAL, Army Ranger, and Air Force Tactical Air Controller, he went on to set records in numerous endurance events, inspiring Outside magazine to name him \"The Fittest (Real) Man in America.\"In Can't Hurt Me, he shares his astonishing life story and reveals that most of us tap into only 40% of our capabilities. Goggins calls this The 40% Rule, and his story illuminates a path that anyone can follow to push past pain, demolish fear, and reach their full potential.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1536184191i/41721428.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"beginning-css-web-development:-from-novice-to-professional","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd0ff"},"name":"The Buntline Special","author":"Mike Resnick","categories":"Steampunk","price":52,"publishYear":2016,"rating":4.733563380464329,"description":"Welcome to a West like you've never seen before, where electric lights shine down on the streets of Tombstone, while horseless stagecoaches carry passengers to and fro, and where death is no obstacle to The Thing That Was Once Johnny Ringo. Think you know the story of the O.K. Corral? Think again, as five-time Hugo winner Mike Resnick takes on his first steampunk western tale, and the West will never be the same.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1284431932i/8253037.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"beginning-php-6-apache-mysql-6-web-development","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd100"},"name":"Clear Thinking: Turning Ordinary Moments into Extraordinary Results","author":"Shane Parrish","categories":"Self Help","price":47,"publishYear":2021,"rating":2.9318132909559402,"description":"AN INSTANT NEW YORK TIMES BESTSELLERFew things will change your trajectory in life or business as much as learning to think clearly. Yet few of us recognize opportunities to think in the first place.You might believe you’re thinking clearly in the moments that matter most. But in all likelihood, when the pressure is on, you won’t be thinking at all. And your subsequent actions will inevitably move you further from the results you ultimately seek—love, belonging, success, wealth, victory. According to Farnam Street founder Shane Parrish, we must get better at recognizing these opportunities for what they are, and deploying our cognitive ability in order to achieve the life we want.Clear Thinking gives you the tools to recognize the moments that have the potential to transform your trajectory, and reshape how you navigate the critical space between stimulus and response. As Parrish shows, we may imagine we are the protagonists in the story of our lives. But the sad truth is, most of us run on autopilot. Our behavioral defaults, groomed by biology, evolution, and culture, are primed to run the show for us if we don’t intervene. At our worst, we react to events without reasoning, not even realizing that we’ve missed an opportunity to think at all. At our best, we recognize these moments for what they are, and apply the full capacity of our reasoning and rationality to them.Through stories, mental models, and more, Parrish offers the missing link between behavioral science and real-life outcomes. The result is a must-have manual for optimizing decision-making, gaining competitive advantage, and living a more intentional life.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1685350454i/75665850.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"web-development-solutions-:-ajax-apis-libraries-and-hosted-services-made-easy","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd101"},"name":"Hidden Potential: The Science of Achieving Greater Things","author":"Adam M. Grant\n","categories":"Self Help","price":27,"publishYear":2004,"rating":4.589855569397116,"description":"“This brilliant book will shatter your assumptions about what it takes to improve and succeed. I wish I could go back in time and gift it to my younger self. It would’ve helped me find a more joyful path to progress.”\n—Serena Williams, 23-time Grand Slam singles tennis champion\n\nThe #1 New York Times bestselling author of Think Again illuminates how we can elevate ourselves and others to unexpected heights.\n\nWe live in a world that’s obsessed with talent. We celebrate gifted students in school, natural athletes in sports, and child prodigies in music. But admiring people who start out with innate advantages leads us to overlook the distance we ourselves can travel. We underestimate the range of skills that we can learn and how good we can become. We can all improve at improving. And when opportunity doesn’t knock, there are ways to build a door.\n\nHidden Potential offers a new framework for raising aspirations and exceeding expectations. Adam Grant weaves together groundbreaking evidence, surprising insights, and vivid storytelling that takes us from the classroom to the boardroom, the playground to the Olympics, and underground to outer space. He shows that progress depends less on how hard you work than how well you learn. Growth is not about the genius you possess—it’s about the character you develop. Grant explores how to build the character skills and motivational structures to realize our own potential, and how to design systems that create opportunities for those who have been underrated and overlooked.\n\nMany writers have chronicled the habits of superstars who accomplish great things. This book reveals how anyone can rise to achieve greater things. The true measure of your potential is not the height of the peak you’ve reached, but how far you’ve climbed to get there.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1689111352i/157095669.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"beginning-smartphone-web-development:-building-javascript-css-html-and-ajax-based-applications-for-iphone-android-palm-pre-blackberry-windows-mobile-and-nokia-s60","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd102"},"name":"Same as Ever: A Guide to What Never Changes","author":"Morgan Housel","categories":"Psychology","price":69,"publishYear":2012,"rating":4.664708799596009,"description":"“Want to understand the changing world? Start with what stays the same. That’s the amazing conclusion of Morgan Housel’s fascinating, useful, and highly-entertaining book.”\n\n— Arthur C. Brooks, Professor, Harvard Kennedy School and Harvard Business School, and #1 New York Times bestselling author\n\n\nFrom the author of the international blockbuster, THE PSYCHOLOGY OF MONEY, a powerful new tool to unlock one of life’s most challenging puzzles.\n\nEvery investment plan under the sun is, at best, an informed speculation of what may happen in the future, based on a systematic extrapolation from the known past.\n\nSame as Ever reverses the process, inviting us to identify the many things that never, ever change.\n\nWith his usual elan, Morgan Housel presents a master class on optimizing risk, seizing opportunity, and living your best life. Through a sequence of engaging stories and pithy examples, he shows how we can use our newfound grasp of the unchanging to see around corners, not by squinting harder through the uncertain landscape of the future, but by looking backwards, being more broad-sighted, and focusing instead on what is permanently true.   \n\nBy doing so, we may better anticipate the big stuff, and achieve the greatest success, not merely financial comforts, but most importantly, a life well lived.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1680687321i/125116554.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"the-microsoft-expression-web-developer's-guide-to-asp.net-3.5:-learn-to-create-asp.net-applications-using-visual-web-developer-2008","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd103"},"name":"Elon Musk","author":"Walter Isaacson","categories":"Biography","price":37,"publishYear":2014,"rating":4.266387508439637,"description":"From the author of Steve Jobs and other bestselling biographies, this is the astonishingly intimate story of the most fascinating and controversial innovator of our era—a rule-breaking visionary who helped to lead the world into the era of electric vehicles, private space exploration, and artificial intelligence. Oh, and took over Twitter.\n\nWhen Elon Musk was a kid in South Africa, he was regularly beaten by bullies. One day a group pushed him down some concrete steps and kicked him until his face was a swollen ball of flesh. He was in the hospital for a week. But the physical scars were minor compared to the emotional ones inflicted by his father, an engineer, rogue, and charismatic fantasist.\n\nHis father’s impact on his psyche would linger. He developed into a tough yet vulnerable man-child, prone to abrupt Jekyll-and-Hyde mood swings, with an exceedingly high tolerance for risk, a craving for drama, an epic sense of mission, and a maniacal intensity that was callous and at times destructive.\n\nAt the beginning of 2022—after a year marked by SpaceX launching thirty-one rockets into orbit, Tesla selling a million cars, and him becoming the richest man on earth—Musk spoke ruefully about his compulsion to stir up dramas. “I need to shift my mindset away from being in crisis mode, which it has been for about fourteen years now, or arguably most of my life,” he said.\n\nIt was a wistful comment, not a New Year’s resolution. Even as he said it, he was secretly buying up shares of Twitter, the world’s ultimate playground. Over the years, whenever he was in a dark place, his mind went back to being bullied on the playground. Now he had the chance to own the playground.\n\nFor two years, Isaacson shadowed Musk, attended his meetings, walked his factories with him, and spent hours interviewing him, his family, friends, coworkers, and adversaries. The result is the revealing inside story, filled with amazing tales of triumphs and turmoil, that addresses the are the demons that drive Musk also what it takes to drive innovation and progress?","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1692288251i/122765395.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"tapestry-5:-building-web-applications:-a-step-by-step-guide-to-java-web-development-with-the-developer-friendly-apache-tapestry-framework","__v":0,"inStock":29},
{"_id":{"$oid":"658467a5c15573864fabd104"},"name":"The Berry Pickers","author":"Amanda Peters\n","categories":"Mystery","price":34,"publishYear":2010,"rating":1.665276148687238,"description":"A four-year-old Mi’kmaq girl goes missing from the blueberry fields of Maine, sparking a tragic mystery that haunts the survivors, unravels a community, and remains unsolved for nearly fifty years.\n\nJuly 1962. A Mi’kmaq family from Nova Scotia arrives in Maine to pick blueberries for the summer. Weeks later, four-year-old Ruthie, the family’s youngest child, vanishes. She is last seen by her six-year-old brother, Joe, sitting on a favorite rock at the edge of a berry field. Joe will remain distraught by his sister’s disappearance for years to come.\n\nIn Maine, a young girl named Norma grows up as the only child of an affluent family. Her father is emotionally distant, her mother frustratingly overprotective. Norma is often troubled by recurring dreams and visions that seem more like memories than imagination. As she grows older, Norma slowly comes to realize there is something her parents aren’t telling her. Unwilling to abandon her intuition, she will spend decades trying to uncover this family secret.\n\nFor readers of The Vanishing Half and Woman of Light, this showstopping debut by a vibrant new voice in fiction is a riveting novel about the search for truth, the shadow of trauma, and the persistence of love across time.\n","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1677605623i/123036004.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"php-5-fast-and-easy-web-development-(fast-and-easy-web-development)","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd105"},"name":"Absolution","author":"Alice McDermott","categories":"Historical Fiction","price":39,"publishYear":2014,"rating":2.280019061195901,"description":"In Saigon in 1963, two young American wives form a wary alliance. Tricia is a starry-eyed newlywed, married to a rising oil engineer “on loan” to US Navy Intelligence. Charlene is a practiced corporate spouse and mother of three, a talented hostess and determined altruist, on a mission to relieve the “wretchedness” she sees all around her.\n\nWhen Tricia miscarries, Charlene sweeps her into a cabal of well-dressed do-gooder American wives. Armed with baskets filled with candy and toys, they descend on hospitals, orphanages, and a leper colony on the coast, determined to relieve suffering, no matter the cost.\n\nSixty years later, Charlene’s daughter reaches out to Tricia, now widowed and living in Washington. As the two relive their shared experience in Saigon, they are forced to come to terms with the ways their own lives have been shaped and stunted by Charlene’s pursuit of “inconsequential good.”\n\nWith a narrative impact that recalls Graham Greene’s The Quiet American , Alice McDermott confronts the unresolved mysteries and ironies of America’s tragic interference in Southeast Asia.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1678678178i/101404407.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"macromedia-flash-mx-2004-fast-and-easy-web-development","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd106"},"name":"North Woods","author":"Daniel Mason","categories":"Fiction","price":26,"publishYear":2010,"rating":2.4907713353177057,"description":"A sweeping novel about a single house in the woods of New England, told through the lives of those who inhabit it across the centuries—a daring, moving tale of memory and fate from the Pulitzer Prize finalist and author of The Piano Tuner and The Winter Soldier.\n\nWhen a pair of young lovers abscond from a Puritan colony, little do they know that their humble cabin in the woods will become home to an extraordinary succession of inhabitants . An English soldier, destined for glory, abandons the battlefields of the New World to devote himself to apples. A pair of spinster twins survive war and famine, only to succumb to envy and desire. A crime reporter unearths a mass grave, but finds the ancient trees refuse to give up their secrets. A lovelorn painter, a conman, a stalking panther, a lusty beetle; as each one confronts the mysteries of the north woods, they come to realize that the dark, raucous, beautiful past is very much alive.\n\nTraversing cycles of history, nature, and even literature, North Woods shows the myriad, magical ways in which we’re connected to our environment and to one another, across time, language and space. Written along with the seasons and divided into the twelve months of the year, it is an unforgettable novel about secrets and fates that asks the timeless how do we live on, even after we’re gone?","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1684816182i/71872930.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"php-fast-and-easy-web-development-2nd-edition","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd107"},"name":"The Fraud","author":"Zadie Smith","categories":"Fiction","price":27,"publishYear":2015,"rating":3.0446287383497594,"description":"The extraordinary first historical novel from bestselling author of White Teeth Zadie Smith\n\nIt is 1873. Mrs Eliza Touchet is the Scottish housekeeper - and cousin by marriage - of a once famous novelist, now in decline, William Ainsworth, with whom she has lived for thirty years.\n\nMrs Touchet is a woman of many interests: literature, justice, abolitionism, class, her cousin, his wives, this life and the next. But she is also sceptical. She suspects her cousin of having no talent; his successful friend, Mr Charles Dickens, of being a bully and a moralist; and England of being a land of facades, in which nothing is quite what it seems.\n\nAndrew Bogle meanwhile grew up enslaved on the Hope Plantation, Jamaica. He knows every lump of sugar comes at a human cost. That the rich deceive the poor. And that people are more easily manipulated than they realise. When Bogle finds himself in London, star witness in a celebrated case of imposture, he knows his future depends on telling the right story.\n\nThe 'Tichborne Trial' captivates Mrs Touchet and all of England. Is Sir Roger Tichborne really who he says he is? Or is he a fraud? Mrs Touchet is a woman of the world. Mr Bogle is no fool. But in a world of hypocrisy and self-deception, deciding what is real proves a complicated task...\n\nBased on real historical events, The Fraud is a dazzling novel about truth and fiction, Jamaica and Britain, fraudulence and authenticity, and the mystery of 'other people.'","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1677770042i/66086834.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"perl-fast-and-easy-web-development","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd108"},"name":"The Vaster Wilds","author":"Lauren Groff","categories":"Historical","price":69,"publishYear":2009,"rating":2.40523525548872,"description":"A taut and electrifying novel from celebrated bestselling author Lauren Groff, about one spirited girl alone in the wilderness, trying to survive\n\nA servant girl escapes from a colonial settlement in the wilderness. She carries nothing with her but her wits, a few possessions, and the spark of god that burns hot within her. What she finds in this terra incognita is beyond the limits of her imagination and will bend her belief in everything that her own civilization has taught her.\n\nLauren Groff’s new novel is at once a thrilling adventure story and a penetrating fable about trying to find a new way of living in a world succumbing to the churn of colonialism. The Vaster Wilds is a work of raw and prophetic power that tells the story of America in miniature, through one girl at a hinge point in history, to ask how—and if—we can adapt quickly enough to save ourselves.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1680169653i/62952130.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"php-oracle-web-development-1","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd0f9"},"name":"Birnam Wood","author":"Eleanor Catton","categories":"Mystery","price":33,"publishYear":2010,"rating":1.7996321514391997,"description":"Five years ago, Mira Bunting founded a guerrilla gardening group: Birnam Wood. An undeclared, unregulated, sometimes-criminal, sometimes-philanthropic gathering of friends, this activist collective plants crops wherever no one will notice: on the sides of roads, in forgotten parks, and neglected backyards. For years, the group has struggled to break even. Then Mira stumbles on an answer, a way to finally set the group up for the long term: a landslide has closed the Korowai Pass, cutting off the town of Thorndike. Natural disaster has created an opportunity, a sizable farm seemingly abandoned.\n\nBut Mira is not the only one interested in Thorndike. Robert Lemoine, the enigmatic American billionaire, has snatched it up to build his end-times bunker--or so he tells Mira when he catches her on the property. Intrigued by Mira, Birnam Wood, and their entrepreneurial spirit, he suggests they work this land. But can they trust him? And, as their ideals and ideologies are tested, can they trust each other?\n\nA gripping psychological thriller from the Booker Prize-winning author of The Luminaries, Birnam Wood is Shakespearean in its wit, drama, and immersion in character. A brilliantly constructed consideration of intentions, actions, and consequences, it is an unflinching examination of the human impulse to ensure our own survival.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1653578326i/60784757.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"wordpress-for-web-developers:-an-introduction-for-web-professionals","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd113"},"name":"Soichi","author":"Junji Ito","categories":"Horror","price":56,"publishYear":2013,"rating":2.9140178036209,"description":"“I’ll get you for this… I’ll show you true horror!”　 Soichi, the unhinged second son of the Tsujii family, chews nails and makes them clatter and clack as he spouts horrific curses to bring about the most bizarre happenings. Whether it’s summer holidays or a birthday party, Soichi can turn any occasion into a nightmare in a heartbeat. What is the terrible secret of his origin? Meanwhile, tormented by his little brother’s never-ending pranks, older brother Koichi has a soundproof room built. But why does it have a series of four doors? And then there’s the strange phenomenon surrounding the handmade casket their grandfather left behind. What on earth—or hell—has the family seen there? Ten tales that celebrate the sinister and hilarious world of Junji Ito’s favorite antihero, Soichi!","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1676826540i/62976865.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"moodle.-e-learning-course-development","__v":0,"inStock":29},
{"_id":{"$oid":"658467a5c15573864fabd115"},"name":"The Helsinki Affair","author":"Anna Pitoniak","categories":"Suspense","price":45,"publishYear":2011,"rating":3.479808081794607,"description":"CIA agent Amanda Cole is thrust into an international conspiracy involving high-profile assassinations and Russian blackmail. It ’ s the case of her lifetime, but solving it might require her to betray another spy—who just so happens to be her father.\n\nAmanda Cole is a brilliant young CIA agent, following in the footsteps of her father Charlie. But Amanda’s posting in Rome is a sleepy one. She’s listless and looking for action when, on a hot summer day, it walks right through her door. A lowly Russian operative is desperate, telling her that a US Senator is about to be assassinated on an overseas trip to Cairo. Amanda believes he’s telling the truth, but her superiors do not, and they determine that the best course of action is no action at all.\n\nBut when the assassination occurs, Amanda is suddenly thrust into an international conspiracy as she tries to find out why the senator was killed. What did he know that made him a target of the KGB and the Kremlin? Amanda pairs up with fast-talking, take-no-bullshit Kath, a brash older woman, and legendary spy, to get to the bottom of the case. The investigation takes them from Rome to London to Moscow to Helsinki.\n\nAs Amanda and Kath get closer to solving a case that involves double agents, blackmailed CEOs, illegal arms transfers, yachting oligarchs, and more, one question keeps coming back to haunt Amanda: why was her father’s name written down in the senator’s notes, notes that he seemed to be putting together right before he died? In order to get to the bottom of this international plot of blackmail, murder, and lies, Amanda must decide where her loyalty lies: with her country or with her family.\n\nThe Helsinki Affair is Pitoniak’s entrée into the genre of full-fledged spy fiction. This explosive novel is for fans of the masters of the genre—John Le Carre and Alan Furst—but will also introduce Pitoniak as a singular new talent in the world of female-centric spy fiction.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1676130404i/101145039.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"catalyst-accelerating-perl-web-application-development","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd116"},"name":"The Intern","author":"Michele Campbell","categories":"Thriller","price":57,"publishYear":2013,"rating":3.553755574600964,"description":"A young Harvard law student falls under the spell of a charismatic judge in this timely and thrilling novel about class, ambition, family and murder.\n\nMadison Rivera lands the internship of a lifetime working for Judge Kathryn Conroy. But Madison has a secret that could destroy her career. Her troubled younger brother Danny has been arrested, and Conroy is the judge on his case.\n\nWhen Danny goes missing after accusing the judge of corruption, Madison’s quest for answers brings her deep into the judge’s glamorous world. Is Kathryn Conroy a mentor, a victim, or a criminal? Is she trying to help Madison or use her as a pawn? And why is somebody trying to kill her?\n\nAs the two women circle each other in a dangerous cat-and-mouse game, will they save each other, or will betrayal leave one of them dead?","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1688421216i/65214026.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"spring-web-flow-2-web-development","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd117"},"name":"The Stranger Upstairs","author":"Lisa M. Matlin","categories":"Mystery","price":70,"publishYear":2018,"rating":4.213139312971669,"description":"A social media influencer with a secret past buys a murder house to renovate, but finds more than she bargained for behind the peeling wallpaper in this gothic psychological debut.\n\nSarah Slade is starting over. As the new owner of the infamous Black Wood House—the scene of a grisly murder-suicide—she’s determined that the fixer-upper will help reach a new audience on her successful lifestyle blog, and distract her from her failing marriage.\n\nBut as Sarah paints over the house’s horrifying past, she knows better than anyone that a new façade can’t conceal every secret. Then the builders start acting erratically and experiencing bizarre accidents—and Sarah knows there’s only so long she can continue to sleep in the bedroom with the bloodstained floor and suffer the mysterious footsteps she hears from the attic.\n\nWhen menacing notes start appearing everywhere, Sarah becomes convinced that someone or something is out to kill her—her husband, her neighbors, maybe even the house itself. The more she remodels Black Wood House, the angrier it seems to become.\n\nWith every passing moment, Sarah’s life spirals further out of control—and with it, her sense of reality. Though she desperately clings to the lies she’s crafted to conceal her own secrets, Sarah Slade must wonder . . . was it all worth it? Or will this house be her final unraveling?","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1679664320i/75495037.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"gis-for-web-developers:-adding-'where'-to-your-web-applications","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd119"},"name":"Dark Corners","author":"Megan Goldin","categories":"Mystery","price":69,"publishYear":2017,"rating":3.4038580934805234,"description":"Terence Bailey is about to be released from prison for breaking and entering, though investigators have long suspected him in the murders of six women. As his freedom approaches, Bailey gets a surprise visit from Maddison Logan, a hot, young influencer with a huge social media following. Hours later, Maddison disappears, and police suspect she’s been kidnapped—or worse. Is Maddison’s disappearance connected to her visit to Bailey? Why was she visiting him in the first place?\n\nWhen they hit a wall in the investigation, the FBI reluctantly asks for Rachel’s help in finding the missing influencer. Maddison seems only to exist on social media; she has no family, no friends, and other than in her posts, most people have never seen her. Who is she, really? Using a fake Instagram account, Rachel Krall goes undercover to BuzzCon, a popular influencer conference, where she discovers a world of fierce rivalry that may have turned lethal.\n\nWhen police find the body of a woman with a tattoo of a snake eating its tail, the FBI must consider a chilling possibility: Bailey has an accomplice on the outside and a dangerous obsession with influencers, including Rachel Krell herself. Suddenly a target of a monster hiding in plain sight, Rachel is forced to confront the very real dangers that lurk in the dark corners of the internet.\n\nRachel Krall, the true crime podcaster star of Megan Goldin’s acclaimed Night Swim returns to search for a popular social media influencer who disappeared after visiting a suspected serial killer.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1666694500i/61884922.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"spring-web-flow-2-web-development","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd118"},"name":"My Darling Girl","author":"Jennifer McMahon","categories":"Fiction","price":65,"publishYear":2008,"rating":3.3123075064225853,"description":"A spine-tingling psychological thriller about a woman who, after taking in her dying, alcoholic mother, begins to suspect demonic possession is haunting her family.\n\nAlison has never been a fan of Christmas. But with it right around the corner and her husband busily decorating their cozy Vermont home, she has no choice but to face it. Then she gets the call.\n\nMavis, Alison’s estranged mother, has been diagnosed with cancer and has only weeks to live. She wants to spend her remaining days with her daughter, son-in-law, and two granddaughters. But Alison grew up with her mother’s alcoholism and violent abuse and is reluctant to unearth these traumatic memories. Still, she eventually agrees to take in Mavis, hoping that she and her mother could finally heal and have the relationship she’s always dreamed of.\n\nBut when mysterious and otherworldly things start happening upon Mavis’s arrival, Alison begins to suspect her mother is not quite who she seems. And as the holiday festivities turn into a nightmare, she must confront just how far she is willing to go to protect her family.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1688658775i/101145269.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"even-faster-web-sites:-performance-best-practices-for-web-developers","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd11a"},"name":"All or Nothing","author":"Lo Everett","categories":"Sports","price":32,"publishYear":2017,"rating":3.88352167565733,"description":"I’m not supposed to fall for my best friend. But fate has a funny way of knowing exactly what we need.\n\nFor the past three years, Delilah Tate has been the only thing aside from baseball that has saved me from my grief. She’s the equivalent of the warm sun filtering through the clouds on the coldest days. She thaws and heals the parts of me that are broken. My brother has been the driving reason behind all my hard work on and off the baseball diamond. But now I have one more reason to fulfill all my promises to him.\n\nBe the man she deserves.\n\nCruz Tellez might think that I’m the one who saved him, but he was there during the worst moments of my life, too.\n\nMy best friend has always been a flirt, but I can’t get him out of my head now that he's stepped up his game. He’s even invaded my dreams, and I’m not sure how I’ll ever face him again after one that was extra steamy. A dream where he sported a filthy mouth, making me question everything I know about what I want in and out of the bedroom. And it’s terrifying.\n\nBut I’m not sure I can fight it anymore. Giving in would be so easy.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1701065466i/202733624.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"developing-large-web-applications:-producing-code-that-can-grow-and-thrive","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd11b"},"name":"The September House","author":"Carissa Orlando","categories":"Horror","price":66,"publishYear":2007,"rating":4.420485982709832,"description":"A woman is determined to stay in her dream home even after it becomes a haunted nightmare in this compulsively readable, twisty, and layered debut novel.\n\nWhen Margaret and her husband Hal bought the large Victorian house on Hawthorn Street—for sale at a surprisingly reasonable price—they couldn’t believe they finally had a home of their own. Then they discovered the hauntings. Every September, the walls drip blood. The ghosts of former inhabitants appear, and all of them are terrified of something that lurks in the basement. Most people would flee.\n\nMargaret is not most people.\n\nMargaret is staying. It’s her house. But after four years Hal can’t take it anymore, and he leaves abruptly. Now, he’s not returning calls, and their daughter Katherine—who knows nothing about the hauntings—arrives, intent on looking for her missing father. To make things worse, September has just begun, and with every attempt Margaret and Katherine make at finding Hal, the hauntings grow more harrowing, because there are some secrets the house needs to keep.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1686576214i/64623481.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"even-faster-web-sites:-performance-best-practices-for-web-developers","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd11c"},"name":"Midnight Is the Darkest Hour","author":"Ashley Winstead","categories":"Thriller","price":43,"publishYear":2021,"rating":1.0596111149974234,"description":"Beware of the dark. You might like what you find...\n\nRuth Collier has always felt like an outsider, even as her father rains fire and brimstone from the church pulpit. In Bottom Springs, his word is as good as law.\n\nBut there are things the townspeople fear more than God, like the Low Man, a vampiric figure said to kill sinners in their beds on moonless nights.\n\nWhen a skull is found deep in the swamp, a hunt for the Low Man begins. Suspicion turns to Everett – Ruth's oldest friend, with a dark past. As Ruth and Everett grow closer, Ruth begins to unearth the town's secrets, determined to discover the truth.\n\nBut as the line between good and evil grows ever thin, how far will Ruth go to save the person she loves most?","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1677779626i/68054323.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"even-faster-web-sites:-performance-best-practices-for-web-developers","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd11d"},"name":"When I'm Dead","author":"Hannah Morrissey","categories":"Fiction","price":36,"publishYear":2021,"rating":4.999799379542169,"description":"One girl murdered. Another one missing. And a medical examiner desperate to uncover the truth in the latest Black Harbor mystery by acclaimed author Hannah Morrissey.\n\nOn a bone-chilling October night, Medical Examiner Rowan Winthorp investigates the death of her daughter’s best friend. Hours later, the tragedy hits even closer to home when she makes a devastating discovery—her daughter, Chloe, is gone. But, not without a trace.\n\nA morbid mosaic of clues forces Rowan and her husband to question how deeply they really knew their daughter. As they work closely to peel back the layers of this case, they begin to unearth disturbing details about Chloe and her secret transgressions…details that threaten to tear them apart.\n\nAmidst the noise of navigating her newfound grief and reconciling the sins of her past, an undeniable fact rings true for Rowan: karma has finally come to collect.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1673873049i/65213515.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"spring-web-flow-2-web-development","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd11e"},"name":"She's Not Sorry","author":"Mary Kubica","categories":"Mystery","price":56,"publishYear":2005,"rating":2.170607517626782,"description":"An ICU nurse accidentally uncovers a patient’s frightening past in this chilling thriller.\n\nMeghan Michaels is trying to find balance between being a single mom to a teenage daughter and working as a full time nurse. While on duty at the hospital one day, a patient named Caitlin arrives in a coma with a traumatic brain injury, having jumped from a bridge and plunging over twenty feet to the train tracks below. \n\nBut when a witness comes forward with shocking details about the fall, it calls everything they know into question. Was Caitlin  pushed  and if so, by whom and why? \n\nMeghan has always tried to stay emotionally detached from her patients, but this time, she mistakenly lets herself get too close until she’s deeply entangled in Caitlin’s and her family’s lives. Only when it’s too late, does she realize that she and her daughter could be the next victims.\n\nLook for these other pulse-pounding thrillers by New York Times bestselling author Mary","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1686154280i/127305817.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"communicating-design:-developing-web-site-documentation-for-design-and-planning-(2nd-edition)-(voices-that-matter)","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd11f"},"name":"Heaven","author":"Mieko Kawakami","categories":"Fiction","price":47,"publishYear":2008,"rating":1.7999720563310984,"description":"Hailed as a bold foray into new literary territory, Kawakami’s novel is told in the voice of a 14-year-old student who subjected to relentless torment for having a lazy eye. Instead of resisting, the boy chooses to suffer in complete resignation. The only person who understands what he is going through is a female classmate who suffers similar treatment at the hands of her tormentors.\n\nThese raw and realistic portrayals of bullying are counterbalanced by textured exposition of the philosophical and religious debates concerning violence to which the weak are subjected.\n\nKawakami's simple yet profound new work stands as a dazzling testament to her literary talent. There can be little doubt that it has cemented her reputation as one of the most important young authors working to expand the boundaries of contemporary Japanese literature.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1615916179i/53223710.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"weaving-a-library-web:-a-guide-to-developing-children's-websites","__v":0},
{"_id":{"$oid":"658467a5c15573864fabd109"},"name":"No Longer Human","author":"Osamu Dazai","categories":"Fiction","price":56,"publishYear":2007,"rating":3.0347123310787527,"description":"Osamu Dazai's No Longer Human, this leading postwar Japanese writer's second novel, tells the poignant and fascinating story of a young man who is caught between the breakup of the traditions of a northern Japanese aristocratic family and the impact of Western ideas. In consequence, he feels himself \"disqualified from being human\" (a literal translation of the Japanese title).\n\nDonald Keene, who translated this and Dazai's first novel, The Setting Sun, has said of the author's work: \"His world … suggests Chekhov or possibly postwar France, … but there is a Japanese sensibility in the choice and presentation of the material. A Dazai novel is at once immediately intelligible in Western terms and quite unlike any Western book.\" His writing is in some ways reminiscent of Rimbaud, while he himself has often been called a forerunner of Yukio Mishima.\n\nCover painting by Noe Nojechowiz, from the collection of John and Barbara Duncan; design by Gertrude Huston","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1422638843i/194746.jpg","createdAt":{"$date":"2023-12-21T16:28:20.982Z"},"startDates":[],"secretBook":false,"slug":"php-oracle-web-development-2","__v":0},
{"_id":{"$oid":"65846883fd3236653b0afd8d"},"name":"Kafka on the Shore","author":"Haruki Murakami","categories":"Fiction","price":21,"publishYear":2020,"rating":4.574154480348234,"description":"Kafka on the Shore, a tour de force of metaphysical reality, is powered by two remarkable characters: a teenage boy, Kafka Tamura, who runs away from home either to escape a gruesome oedipal prophecy or to search for his long-missing mother and sister; and an aging simpleton called Nakata, who never recovered from a wartime affliction and now is drawn toward Kafka for reasons that, like the most basic activities of daily life, he cannot fathom. Their odyssey, as mysterious to them as it is to us, is enriched throughout by vivid accomplices and mesmerizing events. Cats and people carry on conversations, a ghostlike pimp employs a Hegel-quoting prostitute, a forest harbors soldiers apparently unaged since World War II, and rainstorms of fish (and worse) fall from the sky. There is a brutal murder, with the identity of both victim and perpetrator a riddle—yet this, along with everything else, is eventually answered, just as the entwined destinies of Kafka and Nakata are gradually revealed, with one escaping his fate entirely and the other given a fresh start on his own.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1429638085i/4929.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"cakephp-application-development:-step-by-step-introduction-to-rapid-web-development-using-the-open-source-mvc-cakephp-framework","__v":0,"inStock":43},
{"_id":{"$oid":"65846883fd3236653b0afd90"},"name":"Twenty-Seven Minutes","author":"Ashley Tate","categories":"Mystery","price":51,"publishYear":2006,"rating":1.3205264010484132,"description":"In this stunning and propulsive debut, a town grieves the loss of a young girl—but some fight to keep the truth about her death a secret.\n\nThe question\n\nFor the last ten years, the small, claustrophobic town of West Wilmer has been struggling to understand one thing: Why did it take young Grant Dean twenty-seven minutes to call for help on the fateful night of the car accident that took the life of his beloved sister, Phoebe? If he'd called sooner, she might still be alive.\n\nThe secret\n\nAs the anniversary of Phoebe's death approaches, Grant is consumed by memories of that night on the bridge and everything he lost: his future, his reputation, his little sister. And the secret he's been keeping all these years is suffocating him. But he and Phoebe weren't the only ones in the car that night. Becca was there. She knows what happened—and she will do anything to help Grant keep his secret.\n\nThe truth\n\nEveryone in West Wilmer remembers Phoebe, but only June remembers that another person was lost that night. Her brother Wyatt has been missing for ten years and now June is alone—no family, no friends. Until someone appears at her door. Someone who may know where Wyatt went all those years ago. Someone who knows what really happened on the bridge that night. Someone who is ready to tell the truth.\n\nTaking place over three days and culminating in a shocking twist that will leave you breathless, Twenty-Seven Minutes is a gripping story about what happens when grief becomes unbearable, dark secrets are unearthed, and the horrifying truth is revealed.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1680085579i/123416657.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"wordpress-for-web-developers:-an-introduction-for-web-professionals","__v":0,"inStock":33},
{"_id":{"$oid":"65846883fd3236653b0afd8b"},"name":"The Clinic","author":"Cate Quinn","categories":"Thriller","price":39,"publishYear":2020,"rating":1.0960595721222353,"description":"From the critically acclaimed author of Black Widows comes a thriller set in a remote rehab clinic on the Pacific Northwest coast, in which the death of a woman inside prompts her sister to enter the clinic as a patient in order to find the truth. Perfect for fans of Stacy Willingham and Tarryn Fisher!\n\nMeg works for a casino in LA, catching cheaters and popping a few too many pain pills to cope, following a far different path than her sister Haley, a famous actress. But suddenly reports surface of Haley dying at the remote rehab facility where she had been forced to go to get her addictions under control.\n\nThere are whispers of suicide, but Meg can't believe it. She decides that the best way to find out what happened to her sister is to check in herself – to investigate what really happened from the inside.\n\nBattling her own addictions and figuring out the truth will be much more difficult than she imagined, far away from friends, family – and anyone who could help her.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1682065129i/123430981.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"agile-web-development-with-rails","__v":0},
{"_id":{"$oid":"65846883fd3236653b0afd93"},"name":"The Heiress","author":"Rachel Hawkins\n","categories":"Thriller","price":68,"publishYear":2019,"rating":2.9136797400463514,"description":"When Ruby McTavish Callahan Woodward Miller Kenmore dies, she’s not only North Carolina’s richest woman, she’s also its most notorious. The victim of a famous kidnapping as a child and a widow four times over, Ruby ruled the tiny town of Tavistock from Ashby House, her family’s estate high in the Blue Ridge mountains. In the aftermath of her death, that estate—along with a nine-figure fortune and the complicated legacy of being a McTavish—pass to her adopted son, Camden.\n\nBut to everyone’s surprise, Cam wants little to do with the house or the money—and even less to do with the surviving McTavishes. Instead, he rejects his inheritance, settling into a normal life as an English teacher in Colorado and marrying Jules, a woman just as eager to escape her own messy past.\n\nTen years later, Camden is a McTavish in name only, but a summons in the wake of his uncle’s death brings him and Jules back into the family fold at Ashby House. Its views are just as stunning as ever, its rooms just as elegant, but coming home reminds Cam why he was so quick to leave in the first place.\n\nJules, however, has other ideas, and the more she learns about Cam’s estranged family—and the twisted secrets they keep—the more determined she is for her husband to claim everything Ruby once intended for him to have.\n\nBut Ruby’s plans were always more complicated than they appeared. As Ashby House tightens its grip on Jules and Camden, questions about the infamous heiress come to light. Was there any truth to the persistent rumors following her disappearance as a girl? What really happened to those four husbands, who all died under mysterious circumstances? And why did she adopt Cam in the first place? Soon, Jules and Cam realize that an inheritance can entail far more than what’s written in a will––and that the bonds of family stretch far beyond the grave.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1684155150i/126919284.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"professional-javascript-for-web-developers","__v":0},
{"_id":{"$oid":"65846883fd3236653b0afd94"},"name":"Mercury","author":"Amy Jo Burns","categories":"Fiction","price":61,"publishYear":2010,"rating":4.874474271976335,"description":"A roofing family’s bonds of loyalty are tested when they uncover a long-hidden secret at the heart of their blue-collar town―from Amy Jo Burns, author of the critically acclaimed novel Shiner\n\nIt’s 1990 and seventeen-year-old Marley West is blazing into the river valley town of Mercury, Pennsylvania. A perpetual loner, she seeks a place at someone’s table and a family of her own. The first thing she sees when she arrives in town is three men standing on a rooftop. Their silhouettes blot out the sun.\n\nThe Joseph brothers become Marley’s whole world before she can blink. Soon, she is young wife to one, The One Who Got Away to another, and adopted mother to them all. As their own mother fades away and their roofing business crumbles under the weight of their unwieldy father’s inflated ego, Marley steps in to shepherd these unruly men. Years later, an eerie discovery in the church attic causes old wounds to resurface and suddenly the family’s survival hangs in the balance. With Marley as their light, the Joseph brothers must decide whether they can save the family they’ve always known―or whether together they can build something stronger in its place.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1686154280i/127305817.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"art-of-java-web-development:-struts-tapestry-commons-velocity-junit-axis-cocoon-internetbeans-webwork","__v":0},
{"_id":{"$oid":"65846883fd3236653b0afd95"},"name":"The Fury","author":"Simon Collison","categories":"Thriller","price":26,"publishYear":2016,"rating":4.635941228289279,"description":"A masterfully paced thriller about a reclusive ex–movie star and her famous friends whose spontaneous trip to a private Greek island is upended by a murder ― from the #1 New York Times bestselling author of The Silent Patient.\n\nThis is a tale of murder.\n\nOr maybe that’s not quite true. At its heart, it’s a love story, isn’t it?\n\nLana Farrar is a reclusive ex–movie star and one of the most famous women in the world. Every year, she invites her closest friends to escape the English weather and spend Easter on her idyllic private Greek island.\n\nI tell you this because you may think you know this story. You probably read about it at the time ― it caused a real stir in the tabloids, if you remember. It had all the necessary ingredients for a press a celebrity; a private island cut off by the wind…and a murder.\n\nWe found ourselves trapped there overnight. Our old friendships concealed hatred and a desire for revenge. What followed was a game of cat and mouse ― a battle of wits, full of twists and turns, building to an unforgettable climax. The night ended in violence and death, as one of us was found murdered.\n\nBut who am I?\n\nMy name is Elliot Chase, and I’m going to tell you a story unlike any you’ve ever heard.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1684763144i/123206645.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"beginning-css-web-development:-from-novice-to-professional","__v":0,"inStock":29},
{"_id":{"$oid":"65846883fd3236653b0afd96"},"name":"Good Half Gone","author":"Tarryn Fisher","categories":"Thriller","price":35,"publishYear":2009,"rating":3.4576876647025934,"description":"From the #1 New York Times bestselling author of The Wives\n\nIris Walsh saw her twin sister, Piper, get kidnapped—so why does no one believe her?\n\nIris narrowly escaped her pretty, popular twin sister’s fate as a teen: kidnapped, trafficked and long gone before the cops agreed to investigate. With no evidence to go on but a few scattered memories, the case quickly goes cold.\n\nNow an adult, Iris wants one thing—proof. And if the police still won’t help, she’ll just have to find it her own way; by interning at the isolated Shoal Island Hospital for the criminally insane, where secrets lurk in the shadows and are kept under lock and key. But Iris soon realizes that something even more sinister is simmering beneath the surface of the Shoal, and that the patients aren’t the only ones being observed…","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1699626753i/136340537.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"beginning-php-6-apache-mysql-6-web-development","__v":0},
{"_id":{"$oid":"65846883fd3236653b0afd97"},"name":"Daughter of Mine","author":"Megan Miranda","categories":"Mystery","price":48,"publishYear":2006,"rating":3.85498814996067,"description":"The new thrilling novel from Megan Miranda, the instant New York Times bestselling author of All the Missing Girls, The Last to Vanish, and The Only Survivors.\n\nWhen Hazel Sharp, daughter of Mirror Lake’s longtime local detective, unexpectedly inherits her childhood home, she’s warily drawn back to the town—and people—she left behind almost a decade earlier. But Hazel’s not the only relic of the past to a drought has descended on the region, and as the water level in the lake drops, long-hidden secrets begin to emerge…including evidence that may help finally explain the mystery of her mother’s disappearance.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1693932662i/176443330.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"web-development-solutions-:-ajax-apis-libraries-and-hosted-services-made-easy","__v":0,"inStock":29},
{"_id":{"$oid":"65846883fd3236653b0afd98"},"name":"The Summer She Went Missing","author":"Chelsea Ichaso","categories":"Thriller","price":35,"publishYear":2013,"rating":2.388458922849794,"description":"From the author of Dead Girls Can't Tell Secrets and They're Watching You, a compelling new thriller!\n\nLast summer, they searched for Audrey Covington.\n\nThis summer, they'll search for the truth.\n\nPaige Redmond has always felt lucky to spend her summers in Clearwater Ridge, with lazy days sunning at the waterfalls and nights partying at the sprawling houses of the rich families who vacation there. The Covingtons are one of these families, and beautiful, brilliant Audrey Covington is Paige's best friend. And last year, when Audrey's crush-worthy brother Dylan finally started noticing Paige, she was sure it would be the best summer ever.\n\nExcept Audrey didn't seem quite like herself. Then one night, she didn't come home. Though Audrey wasn't the first girl to disappear in Clearwater Ridge, she left behind more lies than clues. Now, one summer later, her case has gone cold, and nobody, least of all Paige, can make sense of what happened.\n\nWhen Paige stumbles across a secret hidden in Audrey's room, however, it changes everything she thought she knew about last summer. She and Dylan set out on their own investigation, discovering things even the police don't know about the people of Clearwater Ridge. But tracking down missing girls—girls who might be beyond saving by now—means entering a world far darker than Paige has ever imagined. And if she isn't careful, she'll become the next girl to vanish.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1685059275i/157000386.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"beginning-smartphone-web-development:-building-javascript-css-html-and-ajax-based-applications-for-iphone-android-palm-pre-blackberry-windows-mobile-and-nokia-s60","__v":0},
{"_id":{"$oid":"65846883fd3236653b0afd99"},"name":"Perfect Little Monsters","author":"Cindy R.X. He","categories":"Mystery","price":24,"publishYear":2007,"rating":1.528632648714404,"description":"Someone has murdered the queen bee of Sierton High School. All the dead girl’s friends are suspects. And each one has a reason for wanting her dead.\n\nElla Moore was the most popular girl in school…and also the most hated. When she’s murdered at her own party, there are too many suspects to count. And too many people who think she deserved it.\n\nThe police’s prime suspect is the new girl, Dawn Foster. Dawn was the last to hand Ella a drink on the night she died. Plus, all of Ella’s friends with a motive for wanting her dead are more than willing to throw Dawn under the bus if it means keeping the heat off themselves.\n\nBut Dawn refuses to go down without a fight. She’s determined to clear her name. As she delves deeper into the past, she discovers that Ella and her friends had major enemies, and someone is out for revenge. Dawn must uncover the truth before the police arrest the wrong suspect… and before the next person dies.\n\nDaphne du Maurier Award Finalist for Excellence in Mystery/Suspense (2022)\nKiller Nashville Claymore Award Finalist for Best Juvenile/YA (2022)","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1694289146i/193544854.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"the-microsoft-expression-web-developer's-guide-to-asp.net-3.5:-learn-to-create-asp.net-applications-using-visual-web-developer-2008","__v":0},
{"_id":{"$oid":"65846883fd3236653b0afd9a"},"name":"That's Not My Name","author":"Megan Lally","categories":"Thriller","price":64,"publishYear":2010,"rating":1.4600380121848566,"description":"She thought she had her life back. She was wrong. It was a mistake to trust him.\n\nShivering and bruised, a teen wakes up on the side of a dirt road with no memory of how she got there―or who she is. A passing officer takes her to the police station, and not long after, a frantic man arrives. He's been searching for her for hours. He has her school ID, her birth certificate, and even family photos. He is her father. Her name is Mary. Or so he says.\n\nWhen Lola slammed the car door and stormed off into the night, Drew thought they just needed some time to cool off. Except Lola disappeared, and the sheriff, his friends, and the whole town are convinced Drew murdered his girlfriend. Forget proving his innocence, he needs to find her before it's too late. The longer Lola is missing, the fewer leads there are to follow…and the more danger they both are in.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1684790275i/123429195.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"tapestry-5:-building-web-applications:-a-step-by-step-guide-to-java-web-development-with-the-developer-friendly-apache-tapestry-framework","__v":0},
{"_id":{"$oid":"65846883fd3236653b0afd9b"},"name":"The Wake-Up Call","author":"Beth O'Leary","categories":"Romance","price":46,"publishYear":2007,"rating":2.154333578421121,"description":"Two hotel receptionists--and arch-rivals--find a collection of old wedding rings and compete to return them to their owners, discovering their own love story along the way.\n\nIt's the busiest season of the year, and Forest Manor Hotel is quite literally falling apart. So when Izzy and Lucas are given the same shift on the hotel's front desk, they have no choice but to put their differences aside and see it through.\n\nThe hotel won't stay afloat beyond Christmas without some sort of miracle. But when Izzy returns a guest's lost wedding ring, the reward convinces management that this might be the way to fix everything. With four rings still sitting in the lost & found, the race is on for Izzy and Lucas to save their beloved hotel--and their jobs.\n\nAs their bitter rivalry turns into something much more complicated, Izzy and Lucas begin to wonder if there's more at stake here than the hotel's future. Can the two of them make it through the season with their hearts intact?","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1681459898i/63946938.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"php-5-fast-and-easy-web-development-(fast-and-easy-web-development)","__v":0},
{"_id":{"$oid":"65846883fd3236653b0afd9c"},"name":"The Good Part","author":"Sophie Cousens","categories":"Romance","price":68,"publishYear":2009,"rating":1.506262109059831,"description":"By the New York Times bestselling author of Just Haven't Met You Yet, a downtrodden twenty-six-year-old wakes up to the life she's always wanted, but is it really a dream come true?\n\nAt twenty-six, Lucy Young is tired. Tired of fetching coffees for senior TV producers, tired of going on disastrous dates, and definitely tired of living in a damp flat share with flatmates who never buy toilet roll. She could quit her job for a better living, but she's not ready to give up on her dreams. Not just yet. After another diabolical date lands her in a sudden storm and no money for bus fare, Lucy finds herself seeking shelter in a tiny shop, where she stumbles upon a curious wishing machine. Pushing her last coin into the slot, Lucy closes her eyes and wishes with everything she's got: Please, let me skip to the good part of my life.\n\nWhen she wakes the next morning to a handsome man, a ring on her finger, a high-powered job, and storybook perfect little boy and baby girl, Lucy can't believe this is real--especially when she looks in the mirror, and staring back is her own forty-something face. Has she really skipped ahead to the future she's always wanted, or has she simply forgotten a huge chunk of her life? And as Lucy begins to embrace this new life and new relationships, she'll have to ask herself: Can she go back, and if so, does she want to?","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1685352418i/112976344.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"macromedia-flash-mx-2004-fast-and-easy-web-development","__v":0},
{"_id":{"$oid":"65846883fd3236653b0afd9d"},"name":"A Winter in New York","author":"Josie Silver","categories":"Romance","price":30,"publishYear":2014,"rating":4.593234699725279,"description":"A young chef stumbles on a secret family recipe that might lead her to the love—and life—she’s been looking for in this stunning novel.\n\nWhen Iris decides to move to New York to restart her life, she realizes she underestimated how big the Big Apple really is—all the nostalgic movies set in New York she’d watched with her mom while eating their special secret-recipe gelato didn’t quite do it justice. \n\nBut Bobby, Iris’s best friend, isn’t about to let her hide away. He drags her to a famous autumn street fair in Little Italy, and as they walk through the food stalls, a little family-run gelateria catches her eye—could it be the same shop that’s in an old photo of her mother’s?\n\nCurious, Iris returns the next day and meets the handsome Gio, who tells her that the shop is in danger of closing. His uncle, sole keeper of their family’s gelato recipe, is in a coma, so they can’t make more. When Iris samples the last remaining batch, she realizes that their gelato and her gelato are one and the same. But how can she tell them she knows their secret recipe when she’s not sure why Gio’s uncle gave it to her mother in the first place?\n\nIris offers her services as a chef to help them re-create the flavor and finds herself falling for Gio and his family. But when Gio’s uncle finally wakes up, all of the secrets Iris has been keeping threaten to ruin the new life—and new love—she’s been building all winter long.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1680198598i/101673373.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"php-fast-and-easy-web-development-2nd-edition","__v":0},
{"_id":{"$oid":"65846883fd3236653b0afd9e"},"name":"The Last Love Note","author":"Emma Grey","categories":"Romance","price":43,"publishYear":2017,"rating":2.9444297428514012,"description":"You may never stop loving the one you lost. But you can still find love again.\n\nKate is a bit of a mess. Two years after losing her young husband Cameron, she’s grieving, solo parenting, working like mad at her university fundraising job, always dropping the ball—and yet clinging to her sense of humor.\n\nLurching from one comedic crisis to the next, she also navigates an overbearing mom and a Tinder-obsessed best friend who's determined to matchmake Kate with her hot new neighbor.\n\nWhen an in-flight problem leaves Kate and her boss, Hugh, stranded for a weekend on the east coast of Australia, she finally has a chance, away from her son, to really process her grief and see what’s right in front of her. Can she let go of the love of her life and risk her heart a second time?\n\nWhen it becomes clear that Hugh is hiding a secret, Kate turns to the trail of scribbled notes she once used to hold her life together. The first note captured her heart. Will the last note set it free?\n\nThe Last Love Note will make listeners laugh, cry, and renew their faith in the resilience of the human heart—and in love itself.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1682987668i/123087802.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"perl-fast-and-easy-web-development","__v":0},
{"_id":{"$oid":"65846883fd3236653b0afd9f"},"name":"No One Can Know","author":"Kate Alice Marshall","categories":"Thriller","price":21,"publishYear":2006,"rating":3.2011874521428316,"description":"The author of What Lies in the Woods returns with a novel about three sisters, two murders, and too many secrets to count.\n\nEmma hasn't told her husband much about her past. He knows her parents are dead and she hasn't spoken to her sisters in years. Then they lose their apartment, her husband gets laid off, and Emma discovers she's pregnant―right as the bank account slips into the red.\n\nThat's when Emma confesses that she has one more asset: her parents' house, which she owns jointly with her estranged sisters. They can't sell it, but they can live in it. But returning home means that Emma is forced to reveal her secrets to her husband: that the house is not a run-down farmhouse but a stately mansion, and that her parents died there.\n\nWere murdered.\n\nAnd that some people say Emma did it.\n\nEmma and her sisters have never spoken about what really happened that night. Now, her return to the house may lure her sisters back, but it will also crack open family and small-town secrets lots of people don’t want revealed. As Emma struggles to reconnect with her old family and hold together her new one, she begins to realize that the things they have left unspoken all these years have put them in danger again.","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1684451250i/127305892.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"php-oracle-web-development-1","__v":0},
{"_id":{"$oid":"65846883fd3236653b0afda0"},"name":"This Spells Love","author":"Kate Robb","categories":"Romance","price":31,"publishYear":2006,"rating":4.9581937463872245,"description":"A young woman tries to heal her heartbreak by casting a spell to erase her ex from her past, but she wakes up in an alternate reality where she’s lost more than she wished for in this witty, whimsical friends-to-lovers debut.\n\nWhat if one little wish changed everything?\n\nWhen Gemma gets dumped by her long-term boyfriend, she reacts the way any reasonable twenty-eight-year-old would: by getting drunk with her sister, kooky aunt, and best friend, Dax. After one too many margaritas, they decide to perform a love- cleansing spell, which promises to erase Gemma’s ex from her memory. They follow all the instructions, including a platonic kiss from Dax to seal the deal.\n\nWhen Gemma wakes up, she realizes that this silly spell has worked. Not only does it seem that she never dated her ex, but the rest of her life is completely unrecognizable. The worst part: Dax has no idea who she is.\n\nTo reverse the spell and get back to her old life, Gemma must convince her once-best-friend-now-near-stranger to kiss her. But as she carries out her plans, she finds herself falling for him—hard. Soon, Gemma begins to wonder whether she even wants to go back to the way things once were. What if Dax was The One all along?","imageCover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1684816198i/75665914.jpg","createdAt":{"$date":"2023-12-21T16:32:03.744Z"},"startDates":[],"secretBook":false,"slug":"php-oracle-web-development-2","__v":0}
]